Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/atdf/PIC32CZ4010CA91208.atdf
            <signals>
              <signal group="COL" function="K" pad="PD08"/>
              <signal group="CRS" function="K" pad="PD09"/>
              <signal group="GTX_CLK" function="L" pad="PD05"/>
              <signal group="MDC" function="K" pad="PA03"/>
              <signal group="MDIO" function="K" pad="PA04"/>
              <signal group="REF_CLK" function="K" pad="PD12"/>
              <signal group="RXD" index="0" function="K" pad="PD11"/>
              <signal group="RXD" index="1" function="K" pad="PD10"/>
              <signal group="RXD" index="2" function="K" pad="PD07"/>
              <signal group="RXD" index="3" function="K" pad="PD06"/>
              <signal group="RXD" index="4" function="K" pad="PD20"/>
              <signal group="RXD" index="5" function="K" pad="PD21"/>
              <signal group="RXD" index="6" function="K" pad="PD19"/>
              <signal group="RXD" index="7" function="K" pad="PD18"/>
              <signal group="RXDV" function="K" pad="PA05"/>
              <signal group="RXER" function="K" pad="PA06"/>
              <signal group="RX_CLK" function="L" pad="PD12"/>
              <signal group="TSUCOMP" function="K" pad="PA22"/>
              <signal group="TSUCOMP" function="K" pad="PC05"/>
              <signal group="TSUCOMP" function="K" pad="PC17"/>
              <signal group="TXD" index="0" function="K" pad="PA01"/>
              <signal group="TXD" index="1" function="K" pad="PA00"/>
              <signal group="TXD" index="2" function="K" pad="PD04"/>
              <signal group="TXD" index="3" function="K" pad="PD03"/>
              <signal group="TXD" index="4" function="K" pad="PD17"/>
              <signal group="TXD" index="5" function="K" pad="PD16"/>
              <signal group="TXD" index="6" function="K" pad="PD15"/>
              <signal group="TXD" index="7" function="K" pad="PD14"/>
              <signal group="TXEN" function="K" pad="PA02"/>
              <signal group="TXER" function="K" pad="PD02"/>
              <signal group="TX_CLK" function="K" pad="PA21"/>
              <signal group="TX_CLK" function="K" pad="PD05"/>
            </signals>
            <parameters>
              <param name="GCLK_ID_TSU" value="55" caption="1588 External Clock"/>
              <param name="GCLK_ID_TX" value="54" caption="GIGE/Loopback clock"/>
              <param name="MEM_MARGINADJ_MSB" value="9" caption="Number of Memory Margin Adjust bits"/>
              <param name="NUM_INT" value="6" caption="Number of Interrupts"/>
              <param name="INSTANCE_ID" value="56" caption="Instance index for ETH"/>
              <param name="MCLK_ID_AXI" value="64" caption="Index for ETH AXI clock"/>
              <param name="MCLK_ID_APB" value="65" caption="Index for ETH APB clock"/>
              <param name="PAC_ID" value="56" caption="Index for ETH registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="ETM" id="SYSTEM_IP" version="1.0.0">
          <instance name="ETM">
            <register-group name="ETM" name-in-module="ETM" address-space="base" offset="0xE0041000"/>
          </instance>
        </module>
        <module name="EVSYS" id="03601" name2="ptg_evsys_u2504_v2" version="2b0">
          <instance name="EVSYS">
            <register-group name="EVSYS" name-in-module="EVSYS" address-space="base" offset="0x44860000"/>
            <parameters>
              <param name="ASYNCHRONOUS_CHANNELS" value="0xFFFFF000" caption="Mask of Only Asynchronous Channels"/>
              <param name="CHANNELS" value="32" caption="Total Number of Channels"/>
              <param name="CHANNELS_BITS" value="5" caption="Number of bits to select Channel"/>
              <param name="GCLK_ID_0" value="6" caption="Index of Generic Clocks for Synchronous Channels 0"/>
              <param name="GCLK_ID_1" value="7" caption="Index of Generic Clocks for Synchronous Channels 1"/>
              <param name="GCLK_ID_2" value="8" caption="Index of Generic Clocks for Synchronous Channels 2"/>
              <param name="GCLK_ID_3" value="9" caption="Index of Generic Clocks for Synchronous Channels 3"/>
              <param name="GCLK_ID_4" value="10" caption="Index of Generic Clocks for Synchronous Channels 4"/>
              <param name="GCLK_ID_5" value="11" caption="Index of Generic Clocks for Synchronous Channels 5"/>
              <param name="GCLK_ID_6" value="12" caption="Index of Generic Clocks for Synchronous Channels 6"/>
              <param name="GCLK_ID_7" value="13" caption="Index of Generic Clocks for Synchronous Channels 7"/>
              <param name="GCLK_ID_8" value="14" caption="Index of Generic Clocks for Synchronous Channels 8"/>
              <param name="GCLK_ID_9" value="15" caption="Index of Generic Clocks for Synchronous Channels 9"/>
              <param name="GCLK_ID_10" value="16" caption="Index of Generic Clocks for Synchronous Channels 10"/>
              <param name="GCLK_ID_11" value="17" caption="Index of Generic Clocks for Synchronous Channels 11"/>
              <param name="GENERATORS" value="138" caption="Total Number of Event Generators"/>
              <param name="GENERATORS_BITS" value="8" caption="Number of bits to select Event Generator"/>
              <param name="SECURE_IMPLEMENTED" value="0" caption="Security Configuration implemented?"/>
              <param name="SPLIT_IRQ_NUM" value="12" caption="Number of channels with dedicated interrupt line request"/>
              <param name="SYNCH_NUM" value="12" caption="Number of Synchronous Channels"/>
              <param name="SYNCH_NUM_BITS" value="4" caption="Number of bits to select Synchronous Channels"/>
              <param name="USERS" value="117" caption="Total Number of Event Users"/>
              <param name="USERS_BITS" value="7" caption="Number of bits to select Event User"/>
              <param name="USERS_GROUPS" value="4" caption="Number of 32-user Groups"/>
              <param name="INSTANCE_ID" value="22" caption="Instance index for EVSYS"/>
              <param name="MCLK_ID_APB" value="30" caption="Index for EVSYS APB clock"/>
              <param name="PAC_ID" value="22" caption="Index for EVSYS registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="FCR" id="03438" name2="pfm_ctrlr_apb_v1" version="1a1">
          <instance name="FCR">
            <register-group name="FCR" name-in-module="FCR" address-space="base" offset="0x44004000"/>
            <parameters>
              <param name="BFM_PNL_ADDR_MSB" value="15" caption="Flash Memory Parameters"/>
              <param name="BFM_SYS_ADDR_MSB" value="16" caption="Flash Memory Parameters"/>
              <param name="CFM_ADDR_BASE" value="0x07000000" caption="Flash Read Controller Parameters"/>
              <param name="CFM_PNL_ADDR_MSB" value="14" caption="Flash Memory Parameters"/>
              <param name="CFM_SYS_ADDR_MSB" value="15" caption="Flash Memory Parameters"/>
              <param name="FCR_AHB_PORTS_NB" value="4" caption="Flash Read Controller Parameters"/>
              <param name="FCR_BFM_ADDR_BASE" value="0x06000000" caption="Flash Read Controller Parameters"/>
              <param name="FCR_CAL_ADDR" value="6000000" caption="Flash Read Controller Parameters"/>
              <param name="FCR_CAL_NUM_READS" value="4" caption="Flash Read Controller Parameters"/>
              <param name="FCR_CRC_PRESENT" value="1" caption="Flash Read Controller Parameters"/>
              <param name="FCR_DAL_ADDR" value="1" caption="Flash Read Controller Parameters"/>
              <param name="FCR_ECC_PRESENT" value="1" caption="Flash Read Controller Parameters"/>
              <param name="FCR_FFF_ADDR" value="1" caption="Flash Read Controller Parameters"/>
              <param name="FCR_FLT_PRESENT" value="0" caption="Flash Read Controller Parameters"/>
              <param name="FCR_FUSES_DATA_CYCLES" value="4" caption="Flash Read Controller Parameters"/>
              <param name="FCR_FUSES_READY_CYCLES" value="1" caption="Flash Read Controller Parameters"/>
              <param name="FCR_F1RR_ADDR" value="1" caption="Flash Read Controller Parameters"/>
              <param name="FCR_F2RR_ADDR" value="1" caption="Flash Read Controller Parameters"/>
              <param name="FCR_HDATA_SIZE" value="64" caption="Flash Read Controller Parameters"/>
              <param name="FCR_HSM_CFG0_BASE" value="64" caption="Flash Read Controller Parameters"/>
              <param name="FCR_HSM_CFG1_BASE" value="64" caption="Flash Read Controller Parameters"/>
              <param name="FCR_HSM_CFG2_BASE" value="64" caption="Flash Read Controller Parameters"/>
              <param name="FCR_HSM_CFG3_BASE" value="64" caption="Flash Read Controller Parameters"/>
              <param name="FCR_HSM_PRESENT" value="1" caption="Flash Read Controller Parameters"/>
              <param name="FCR_NOT_FFF_VALUE" value="0xA5A5A5A5" caption="Flash Read Controller Parameters"/>
              <param name="FCR_NO_ECC_BUS_ERROR" value="0" caption="Flash Read Controller Parameters"/>
              <param name="FCR_OTPLOCK_ADDR" value="0" caption="Flash Read Controller Parameters"/>
              <param name="FCR_PADDR_MSB" value="15" caption="Flash Read Controller Parameters"/>
              <param name="FCR_PERIOD_MIN" value="75" caption="Flash Read Controller Parameters"/>
              <param name="FCR_PERIOD_NOM" value="116" caption="Flash Read Controller Parameters"/>
              <param name="FCR_PFM_ADDR_BASE" value="0x08000000" caption="Flash Read Controller Parameters"/>
              <param name="FCR_RR_NUM_READS" value="1" caption="Flash Read Controller Parameters"/>
              <param name="FCR_TCALH_NS" value="10000" caption="Flash Read Controller Parameters"/>
              <param name="FUSES_DATA_MSB" value="127" caption="Flash Read Controller Parameters"/>
              <param name="FUSES_RDY_MSB" value="8" caption="Flash Read Controller Parameters"/>
              <param name="NVR_NUM_PAGES" value="24" caption="Flash Memory Parameters"/>
              <param name="PFM_ACC_HT_NS" value="30" caption="Flash Read Controller Parameters"/>
              <param name="PFM_ACC_NS" value="25" caption="Flash Read Controller Parameters"/>
              <param name="PFM_ACC_RECALL_NS" value="70" caption="Flash Read Controller Parameters"/>
              <param name="PFM_DATA_MSB" value="255" caption="Flash Memory Parameters"/>
              <param name="PFM_NUM_PANELS" value="2" caption="Flash Memory Parameters"/>
              <param name="PFM_NUM_RR" value="8" caption="Flash Memory Parameters"/>
              <param name="PFM_PAGE_ADDR_MSB" value="11" caption="Flash Memory Parameters"/>
              <param name="PFM_PNL_ADDR_MSB" value="21" caption="Flash Memory Parameters"/>
              <param name="PFM_PNL_DATA_MSB" value="271" caption="Flash Memory Parameters"/>
              <param name="PFM_ROW_ADDR_MSB" value="9" caption="Flash Memory Parameters"/>
              <param name="PFM_SRHT_PRESENT" value="1" caption="Flash Read Controller Parameters"/>
              <param name="PFM_SYS_ADDR_MSB" value="22" caption="Flash Memory Parameters"/>
              <param name="PFM_TDPDH_NS" value="5000" caption="Flash Read Controller Parameters"/>
              <param name="PFM_TDPDS_NS" value="100" caption="Flash Read Controller Parameters"/>
              <param name="PFM_TLKCFG_NS" value="1000" caption="Flash Read Controller Parameters"/>
              <param name="PFM_TMH_NS" value="100" caption="Flash Read Controller Parameters"/>
              <param name="PFM_TMS_NS" value="5000" caption="Flash Read Controller Parameters"/>
              <param name="PFM_TONWAIT_NS" value="6000" caption="Flash Read Controller Parameters"/>
              <param name="PFM_TRHR_NS" value="1000" caption="Flash Read Controller Parameters"/>
              <param name="PFM_TRT_NS" value="500" caption="Flash Read Controller Parameters"/>
              <param name="INSTANCE_ID" value="2" caption="Instance index for FCR"/>
              <param name="MCLK_ID_AHB" value="4" caption="Index for FCR AHB clock"/>
              <param name="MCLK_ID_APB" value="5" caption="Index for FCR APB clock"/>
              <param name="PAC_ID" value="2" caption="Index for FCR registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="FCW" id="03433" name2="pfm_ctrlw_apb_v1" version="1a1">
          <instance name="FCW">
            <register-group name="FCW" name-in-module="FCW" address-space="base" offset="0x44002000"/>
            <parameters>
              <param name="BFM_PNL_ADDR_MSB" value="15" caption="Flash Memory Parameters"/>
              <param name="BFM_SYS_ADDR_MSB" value="16" caption="Flash Memory Parameters"/>
              <param name="CFM_PNL_ADDR_MSB" value="14" caption="Flash Memory Parameters"/>
              <param name="CFM_SYS_ADDR_MSB" value="15" caption="Flash Memory Parameters"/>
              <param name="FCW_BFM_ADDR_BASE" value="0x06000000" caption="Flash System Address (byte addresses)"/>
              <param name="FCW_CFM_ADDR_BASE" value="0x07000000" caption="Flash System Address (byte addresses)"/>
              <param name="FCW_CPUS_PRESENT" value="3" caption="Flash System Address (byte addresses)"/>
              <param name="FCW_DAL0_VALUE" value="0x81" caption="Flash System Address (byte addresses)"/>
              <param name="FCW_DAL1_VALUE" value="0x99" caption="Flash System Address (byte addresses)"/>
              <param name="FCW_DAL2_VALUE" value="0xDB" caption="Flash System Address (byte addresses)"/>
              <param name="FCW_HSM_PRESENT" value="1" caption="Flash System Address (byte addresses)"/>
              <param name="FCW_PADDR_MSB" value="10" caption="Flash System Address (byte addresses)"/>
              <param name="FCW_PERIOD_MIN" value="75" caption="Flash System Address (byte addresses)"/>
              <param name="FCW_PERIOD_NOM" value="116" caption="Flash System Address (byte addresses)"/>
              <param name="FCW_PFM_ADDR_BASE" value="0x08000000" caption="Flash System Address (byte addresses)"/>
              <param name="PFM_NUM_PAGES" value="1024" caption="No of PFM Pages Per panel"/>
              <param name="PFM_NUM_RR" value="8" caption="Flash Memory Parameters"/>
              <param name="PFM_PAGE_ADDR_MSB" value="11" caption="Flash Page Size MSB"/>
              <param name="PFM_PAGE_SIZE" value="4096" caption="PFM page size"/>
              <param name="PFM_PNL_ADDR_MSB" value="21" caption="Single flash panel read address MSbit (using byte addressing)"/>
              <param name="PFM_PNL_DATA_MSB" value="271" caption="Flash Memory Parameters"/>
              <param name="PFM_ROW_ADDR_MSB" value="9" caption="Flash Memory Parameters"/>
              <param name="PFM_SIZE" value="10" caption="Flash Memory Parameters"/>
              <param name="PFM_SYS_ADDR_MSB" value="22" caption="The MS bit of the system byte address needed to address the entire PFM region (both panels Main)"/>
              <param name="FLASH_SIZE" value="4194304"/>
              <param name="PAGES" value="1024"/>
              <param name="PAGES_PR_REGION" value="64"/>
              <param name="INSTANCE_ID" value="1" caption="Instance index for FCW"/>
              <param name="MCLK_ID_AHB" value="2" caption="Index for FCW AHB clock"/>
              <param name="MCLK_ID_APB" value="3" caption="Index for FCW APB clock"/>
              <param name="PAC_ID" value="1" caption="Index for FCW registers write protection"/>
            </parameters>
          </instance>
        </module>
