Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/atdf/PIC32CZ4010CA91208.atdf
        <register name="MFR" offset="0x1160" rw="RW" size="4" initval="0x00000000" caption="Multicast Frames Received Register">
          <bitfield name="MFRX" caption="Multicast Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="PFR" offset="0x1164" rw="RW" size="4" initval="0x00000000" caption="Pause Frames Received Register">
          <bitfield name="PFRX" caption="Pause Frames Received Register" mask="0xFFFF"/>
        </register>
        <register name="BFR64" offset="0x1168" rw="RW" size="4" initval="0x00000000" caption="64 Byte Frames Received Register">
          <bitfield name="NFRX" caption="64 Byte Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFR127" offset="0x116C" rw="RW" size="4" initval="0x00000000" caption="65 to 127 Byte Frames Received Register">
          <bitfield name="NFRX" caption="65 to 127 Byte Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFR255" offset="0x1170" rw="RW" size="4" initval="0x00000000" caption="128 to 255 Byte Frames Received Register">
          <bitfield name="NFRX" caption="128 to 255 Byte Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFR511" offset="0x1174" rw="RW" size="4" initval="0x00000000" caption="256 to 511Byte Frames Received Register">
          <bitfield name="NFRX" caption="256 to 511 Byte Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFR1023" offset="0x1178" rw="RW" size="4" initval="0x00000000" caption="512 to 1023 Byte Frames Received Register">
          <bitfield name="NFRX" caption="512 to 1023 Byte Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFR1518" offset="0x117C" rw="RW" size="4" initval="0x00000000" caption="1024 to 1518 Byte Frames Received Register">
          <bitfield name="NFRX" caption="1024 to 1518 Byte Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TMXBFR" offset="0x1180" rw="RW" size="4" initval="0x00000000" caption="1519 to Maximum Byte Frames Received Register">
          <bitfield name="NFRX" caption="1519 to Maximum Byte Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="UFR" offset="0x1184" rw="RW" size="4" initval="0x00000000" caption="Undersize Frames Received Register">
          <bitfield name="UFRX" caption="Undersize Frames Received" mask="0x3FF"/>
        </register>
        <register name="OFR" offset="0x1188" rw="RW" size="4" initval="0x00000000" caption="Oversize Frames Received Register">
          <bitfield name="OFRX" caption="Oversized Frames Received" mask="0x3FF"/>
        </register>
        <register name="JR" offset="0x118C" rw="RW" size="4" initval="0x00000000" caption="Jabbers Received Register">
          <bitfield name="JRX" caption="Jabbers Received" mask="0x3FF"/>
        </register>
        <register name="FCSE" offset="0x1190" rw="RW" size="4" initval="0x00000000" caption="Frame Check Sequence Errors Register">
          <bitfield name="FCKR" caption="Frame Check Sequence Errors" mask="0x3FF"/>
        </register>
        <register name="LFFE" offset="0x1194" rw="RW" size="4" initval="0x00000000" caption="Length Field Frame Errors Register">
          <bitfield name="LFER" caption="Length Field Frame Errors" mask="0x3FF"/>
        </register>
        <register name="RSE" offset="0x1198" rw="RW" size="4" initval="0x00000000" caption="Receive Symbol Errors Register">
          <bitfield name="RXSE" caption="Receive Symbol Errors" mask="0x3FF"/>
        </register>
        <register name="AE" offset="0x119C" rw="RW" size="4" initval="0x00000000" caption="Alignment Errors Register">
          <bitfield name="AER" caption="Alignment Errors" mask="0x3FF"/>
        </register>
        <register name="RRE" offset="0x11A0" rw="RW" size="4" initval="0x00000000" caption="Receive Resource Errors Register">
          <bitfield name="RXRER" caption="Receive Resource Errors" mask="0x3FFFF"/>
        </register>
        <register name="ROE" offset="0x11A4" rw="RW" size="4" initval="0x00000000" caption="Receive Overrun Register">
          <bitfield name="RXOVR" caption="Receive Overruns" mask="0x3FF"/>
        </register>
        <register name="IHCE" offset="0x11A8" rw="RW" size="4" initval="0x00000000" caption="IP Header Checksum Errors Register">
          <bitfield name="HCKER" caption="IP Header Checksum Errors" mask="0xFF"/>
        </register>
        <register name="TCE" offset="0x11AC" rw="RW" size="4" initval="0x00000000" caption="TCP Checksum Errors Register">
          <bitfield name="TCKER" caption="TCP Checksum Errors" mask="0xFF"/>
        </register>
        <register name="UCE" offset="0x11B0" rw="RW" size="4" initval="0x00000000" caption="UDP Checksum Errors Register">
          <bitfield name="UCKER" caption="UDP Checksum Errors" mask="0xFF"/>
        </register>
        <register name="AFP" offset="0x11B4" rw="RW" size="4" initval="0x00000000" caption="UDP Checksum Errors Register">
          <bitfield name="RDMAFP" caption="Receive DMA Flushed Packets" mask="0xFFFF"/>
        </register>
        <register name="TISUBN" offset="0x11BC" rw="RW" size="4" initval="0x00000000" caption="1588 Timer Increment [15:0] Sub-Nanoseconds Register">
          <bitfield name="MSBTIR" caption="MSB [23:8] of Timer Increment sub-ns value" mask="0xFFFF"/>
          <bitfield name="LSBTIR" caption="LSB [7:0] of Timer Increment sub-ns value" mask="0xFF000000"/>
        </register>
        <register name="TSH" offset="0x11C0" rw="RW" size="4" initval="0x00000000" caption="1588 Timer Seconds Register 47:32">
          <bitfield name="TMR" caption="Timer Value MSB [47:32]" mask="0xFFFF"/>
        </register>
        <register name="TSSSH" offset="0x11C4" rw="R" size="4" initval="0x00000000" caption="1588 Timer Sync Strobe Seconds Register 47:32">
          <bitfield name="VTS" caption="1588 Timer Sync Strobe Seconds" mask="0xFFFF"/>
        </register>
